# StairsTriserIsTypeOverridden Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsTriserIsTypeOverridden Property
ParameterTypeId Class See Also
---
"Overridden": (OBSOLETE) Indicate whether selected individual step is governed by default type setting.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsTriserIsTypeOverridden { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsTriserIsTypeOverridden As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsTriserIsTypeOverridden {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace